---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricAreaWrongSheetAlignment
source: html/ef415dda-ca6d-b8e5-e117-485cb990ee07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricAreaWrongSheetAlignment Property

Fabric Area Sheet Alignment is incorrect. Can't create Fabric Area.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricAreaWrongSheetAlignment { get; }
```